#include <stdio.h> // stdio = standard input/output - стандартная библиотека ввода вывода,
int main()         // точка входа в программу
{
    printf("Hello everybody!\n");
    printf("\n");
    
    printf("Hello everybody!\t");
    printf("\n");
    
    printf("Hello everybody!\\");
    printf("\n");
    
    printf("Hello everybody!\?");
    printf("\n");
    
    printf("Hello \v everybody!");
    printf("\n");

    printf("Hello everybody!\'");
    printf("\n");
    
//     \n - новая строка
//     \t - горизонтальная табульция
//     \\ - обратный слеш
//     \0 - нулевой символ
//     \? - знак вопроса
//     \v - вертикальная табуляция
//     \' - апостроф
    
    printf("=================================================\n");
    
// тип данных - определяет размер выделенной под переменную ячейки памяти
    
    int number = 2020;
    printf("number = %05d\n", number);
    printf("size of number = %lu\n", sizeof(number));
    printf("number = %x\n", number);
    
    // % - куда печатать переменную
    // 0 - заполнить незначащими нулями слева
    // 20 - всего 20 символов;
    // d - десятичное целое;
    // x - 16-теричное целое

    printf("=================================================\n");
    
    char letter = 'A';
    printf("letter = %c\n", letter); // печатает сам символ
    printf("letter = %d\n", letter); // печатает его код в таблице ASCII
    printf("size of letter = %lu\n", sizeof(letter)); // размер занимаемой памяти в байтах

    printf("=================================================\n");
    
    // идентификаторы знаковый/беззнаковый тип (на примере char)
    
    signed char x = -128; //  диапазон [-128; 127]
    unsigned char y = 255; // диапазон [0; 255]
    
    printf(" signed = %d\n unsigned = %u\n", x, y);
    // u - беззнаковое
    
    printf("=================================================\n");

    long long int e = 10000000;
    printf("e = %lld\n", e);
    // l - для длинных типов (от слова long)
    
    printf("=================================================\n");

    // с плавающей точкой
    float number_2 = 5.678;
    printf("c = %07.2f\n", number_2);
    // % - куда печатать переменную;
    // 0 и 7 - добавить 0 слева, так чтобы всего получилось 7 символов, считая точку;
    // .2 - 2 символа после запятой с округлением;
    // f - для чисел с плавающей точкой;

    printf("=================================================\n");
    
    double number_3 = 5.0006;
    printf("d = %lf\n", number_3); // возможно так же %f, %lg
    
    return 0;
}


// Типы данных:             Спецификаторы формата:
// char                     %c(символ) %d(число)
// int                      %i или %d
// short                    %hi
// long                     %li или %ld
// long long                %lli или %lld
// float                    %f
// double                   %lf или %lg
// ==========================================
// signed   - знаковый тип данных
// unsigned - беззнаковый тип данных
